-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1:3308
-- 生成日期： 2024-01-20 18:52:13
-- 服务器版本： 10.4.28-MariaDB
-- PHP 版本： 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `covid`
--

-- --------------------------------------------------------

--
-- 表的结构 `article`
--

CREATE TABLE `article` (
  `id` int(11) NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `content` text DEFAULT NULL,
  `date` date DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `viewed` int(11) DEFAULT NULL,
  `created_by` int(11) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `category_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `article`
--

INSERT INTO `article` (`id`, `title`, `description`, `content`, `date`, `image`, `viewed`, `created_by`, `status`, `category_id`) VALUES
(12, '日本核污水正式排海对我们的影响有多大？海鲜还敢吃吗？', '<p>日本此次核污水排放，会对我们的生活造成哪些影响？我们要不要囤碘盐、还能不能吃海鲜了呢？</p>\r\n', '<p>据报道，日本核电站污水氚排放的国家标准是每升水中氚活度为6万贝克勒尔（贝克勒尔是衡量放射性活度单位）</p>\r\n\r\n<p>虽然日本当局表示将污水中氚的浓度稀释到这一标准的四十分之一以下，但不少科学家与环保组织都表示，核污水的巨大体量和现有技术的局限，决定了目前无法预知这些污水将给海洋环境和人类安全造成何种危害。</p>\r\n\r\n<p>从海域、海洋生物再到我们人类自己都可能遭受伤害。</p>\r\n\r\n<p>1. 海域污染</p>\r\n\r\n<p>日本将核污水排放到太平洋，而太平洋存在着洋流（即海水大规模的水平流动），在北太平洋环流和副极地环流的双重作用下，放射性物质会扩散到太平洋大半区域。</p>\r\n\r\n<p>海洋虽然有自净能力，但核污水所含的部分放射性物质在千年内依然有害。例如该核电厂污水中所含的碳-14，半衰期长达5730年。也就是说，有些放射性物质在数千年之后，其辐射强度只能衰减一半。</p>\r\n\r\n<p>2. 海洋生物污染</p>\r\n\r\n<p>而污水中的放射性同位素排放入海后会进入海洋生物体内，并随食物链迁移、积累和逐级放大。</p>\r\n\r\n<p>3. 影响人类健康</p>\r\n\r\n<p>人一旦食用被放射性元素污染的海产品，就可能造成内照射（体内污染），从而诱发放射病，增大患癌症等疾病的风险。即使是低剂量的辐射暴露，也可能造成不可预知的伤害，例如基因损伤。</p>\r\n\r\n<p>● 对于发育阶段的儿童和青少年，可能导致发育畸形。由于发育阶段本身就属于对外界刺激敏感的阶段，而核辐射引发的一系列电离反应，无论是在核酸层面还是在蛋白质层面，都会导致个体发育受到影响，进一步导致畸形。</p>\r\n\r\n<p>● 对于普通人群，可能诱发癌症。核辐射可引发基因变异，如果基因变异恰好发生在一些重要的位置，导致这些基因的修复能力下降，结果就可能引发细胞内的DNA错误积累。</p>\r\n\r\n<p>如果这些错误积累无法被彻底消除，且一定程度上逃脱了人体的免疫监控，发生无限扩增，就会诱发癌症。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>核污水排放以后，我们还能吃海鲜吗？</strong></p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>先上结论：核污水排放后对我国海鲜会产生一定影响，但并不是绝对不能吃。</p>\r\n\r\n<p>北海道渔场是北太平洋渔场的中心，也是世界第一大渔场，盛产沙丁鱼、秋刀鱼、三文鱼、鳕鱼、鱿鱼、蛤蜊、牡蛎等海产品。这些海域的海鲜都有可能受到污染。</p>\r\n\r\n<p>我国海关总署已明确，即日起全面暂停进口日本水产品，后面会持续关注日本核污染水排海情况，再根据情况调整监管措施。</p>\r\n\r\n<p>那过你海鲜呢？</p>\r\n\r\n<p>不可否认，我国沿海地区会也可能会受到一定影响，即便是国产海鲜，如果是在被核污水污染水域，肉质依然可能含放射性物质，应该按照国家相关标准开展监测，满足标准后方可食用。</p>\r\n', '2024-01-20', '9fdfbfd922bbf1effd94d2dc7b139b15.jpg', NULL, 28, 1, 1),
(13, '日本宣布周四起排放　北京斥“极端自私”　香港禁十都县水产进口', '<p><strong>在邻国的反对声中，日本仍决定从周四（8月24日）起将处理后的福岛核电站放射性污水排入太平洋，预计将在30年内持续排放。</strong></p>\r\n', '<p>自2011年海啸破坏福岛第一核电站以来，该地已经积累了134万吨水，足以装满500座奥林匹克标准游泳池。</p>\r\n\r\n<p>国际原子能机构（IAEA）今年7月对该排放计划打开绿灯，指其符合国际安全标准。</p>\r\n\r\n<p>日本首相岸田文雄在周二（22日）在内阁会议后表示，如果天气和海况适宜，当局将要求核电站运营商&ldquo;迅速准备&rdquo;在8月24日开始进行排水。</p>\r\n\r\n<p>他表示：&ldquo;今后就算需要数十年的较长时间，作为政府都将负起责任应对，直到处理水处置完毕。&rdquo;</p>\r\n\r\n<ul>\r\n	<li><a href=\"https://www.bbc.com/zhongwen/simp/science-66264193\">福岛核灾废水与核电厂废水哪个更可怕？</a></li>\r\n	<li><a href=\"https://www.bbc.com/zhongwen/simp/world-66198759\">福岛核废水处理问题中的事实与恐惧</a></li>\r\n	<li><a href=\"https://www.bbc.com/zhongwen/simp/science-65963585\">福岛核废水排海倒计时邻居反应激烈 &ldquo;不仅是经济问题，还生死攸关&rdquo;</a></li>\r\n	<li><a href=\"https://www.bbc.com/zhongwen/simp/world-65107965\">日本百万吨福岛核废水排放在即 你会喝一罐产自那里的桃汁吗？</a></li>\r\n	<li><a href=\"https://www.bbc.com/zhongwen/simp/world-56344583\">日本福岛核电站事故10周年：当年发生了什么</a></li>\r\n</ul>\r\n\r\n<p>岸田文雄上周日（20日）访问了东京电力公司的福岛第一核电站视察，引发了有关排放即将开始的猜测。</p>\r\n\r\n<p>在日本宣布该决定后，中国外交部发言人汪文斌指责日本政府此举是&ldquo;向全世界转嫁核污染风险，将一己私利凌驾于全人类长远福祉之上&rdquo;，&ldquo;极端自私，极不负责任&rdquo;，表示北京已提出严正交涉。</p>\r\n\r\n<p>今年7月，中国海关总署已禁止输入包括福岛在内的日本10都县的水产，未在禁止名单的其余地区水产也须经过检测核格才能进口。</p>\r\n\r\n<p>香港特区政府周二宣布，从周四开始禁止日本东京都、福岛县等十个都县的所有水产品，包括活生、冷冻与干燥制品，进口香港。</p>\r\n\r\n<p>这十个都县包括：东京、福岛、千叶、栃木、茨城、群马、宫城、新潟、长野和埼玉。</p>\r\n\r\n<p>韩国政府表示，首尔认为日本的排放计划&ldquo;在科学或技术方面没有问题&rdquo;，但这不代表同意或支持排放计划。</p>\r\n\r\n<p>韩国反对党则抨击日本的排放计划&ldquo;自私且不负责任&rdquo;。</p>\r\n\r\n<p>台湾外交部曾经于7月表示，考察团已三度赴日了解排放废水进程，将持续敦促日方，在符合国际标准及规范下，执行排放作业。</p>\r\n\r\n<p>2011年，9.0级地震引发的海啸淹没了福岛第一核电站的三座反应堆，导致堆芯熔毁。该事件被认为是自切尔诺贝利事件以来世界上最严重的核灾难。</p>\r\n\r\n<p>日本政府表示，对于福岛核电站漫长的退役流程来说，排放核废水是必要步骤。该核电站位于日本东海岸，在东京东北约220公里（137英里）处。</p>\r\n\r\n<p>当地渔民表示，担心排放这些废水会影响他们的生计。</p>\r\n\r\n<p>准备排放的废水包括核电厂机组爆炸后，渗入机芯的地下水，也有本来抽取来冷却机组的海水。</p>\r\n\r\n<p>核电站运营商东电公司一直在对水进行过滤，以去除60多种放射性物质，但水不会完全无辐射，因为其仍然含有氢和碳的放射性同位素氚和碳-14，它们无法轻易从水中去除。</p>\r\n\r\n<p><a href=\"https://ichef.bbci.co.uk/news/640/cpsprodpb/2235/production/_130475780_alps_fukushima_graph640_v3-nc.png\"><img alt=\"\" src=\"https://ichef.bbci.co.uk/news/640/cpsprodpb/2235/production/_130475780_alps_fukushima_graph640_v3-nc.png\" style=\"height:711px; margin-left:250px; margin-right:250px; width:400px\" /></a></p>\r\n\r\n<p>香港核学会主席陆炳林博士曾对BBC中文分析说：&ldquo;现在福岛所排放的废水，除了一些核电站废水常见的放射性元素，例如氚、碳-14之外，还多了许多所谓的&#39;超铀&#39;放射性物质，比如钚、锶、铯。那么在一般的核电厂里是不会排出这么高毒素的放射物。&rdquo;</p>\r\n\r\n<p>国际环保组织绿色和平（Greenpeace）于2021年5月发表的专题文章指出，一般核电厂运行的废水不会直接接触机芯燃料棒，这就是福岛核废水与一般核电厂废水的根本分别。</p>\r\n\r\n<p>文章还引用美国马萨诸塞州伍兹霍尔海洋研究所（Woods Hole Oceanographic Institution）资深科学家肯&middot;布塞勒博士（Dr Ken O Buesseler）发表于2020年8月的论文称，据估算，现存福岛核废水内放射性氚的辐射总量高达1000太贝克。</p>\r\n\r\n<p>不过，日本政府与运营福岛第一核电站的东京电力公司（TEPCO）强调，这些核废水将经过&ldquo;先进液体处理系统&rdquo;（ALPS，又译多核种除去设备）处理，再通过海底隧道从一公里外的近海排放出去。ALPS据称能过滤多种放射性物质，但氚除外。</p>\r\n\r\n<p>专家认为，除非大量饮用，否则排放不会造成危险，因为它们释放的辐射量非常低。</p>\r\n\r\n<p>东京此前表示，将释放到太平洋的废水已经与海水混合，其中的氚和碳14的含量符合安全标准。</p>\r\n\r\n<p>在日本政府宣布排放决定后，东京有抗议者在首相官邸外举行集会，敦促政府停止排放。</p>\r\n', '2024-01-20', 'd3a0f97f2fa353b83457a2acb5daefb9.jpg', NULL, 28, 1, 1);

-- --------------------------------------------------------

--
-- 表的结构 `article_tag`
--

CREATE TABLE `article_tag` (
  `id` int(11) NOT NULL,
  `article_id` int(11) DEFAULT NULL,
  `tag_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

-- --------------------------------------------------------

--
-- 表的结构 `category`
--

CREATE TABLE `category` (
  `id` int(11) NOT NULL,
  `title` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `category`
--

INSERT INTO `category` (`id`, `title`) VALUES
(1, '有关核辐射');

-- --------------------------------------------------------

--
-- 表的结构 `comment`
--

CREATE TABLE `comment` (
  `id` int(11) NOT NULL,
  `text` varchar(255) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `article_id` int(11) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `date` date DEFAULT NULL,
  `video_id` varchar(16) DEFAULT 'null',
  `password` varchar(20) DEFAULT 'pass123'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `comment`
--

INSERT INTO `comment` (`id`, `text`, `user_id`, `article_id`, `status`, `date`, `video_id`, `password`) VALUES
(1, 'lol', 2, 2, 1, '2020-05-09', 'null', 'pass123'),
(2, 'soom', 2, 2, 1, '2020-05-09', NULL, 'pass123'),
(4, 'hello\r\n', 2, 2, 1, '2020-05-09', NULL, 'pass123'),
(5, 'hello', 2, NULL, 1, '2020-05-09', NULL, 'pass123'),
(6, 'a', 2, 2, 1, '2020-05-09', 'null', 'pass123'),
(7, 'lala', 2, 2, 1, '2020-05-09', 'null', 'pass123'),
(8, 'kk', 4, 2, 1, '2020-05-09', 'null', 'pass123'),
(13, 'kk', 2, 0, 1, '2020-05-09', 'ECR47F1S', 'pass123'),
(14, 'video', 2, 0, 1, '2020-05-09', 'ECR47F1S', 'pass123'),
(15, 'videoagin', 2, NULL, 1, '2020-05-09', 'ECR47F1S', 'pass123'),
(16, 'testing testing', 6, 3, 1, '2020-06-01', 'null', 'pass123'),
(17, 'I\'ll be sure to be avoiding camels, bats, and pangolins and blow torch my steak and eggs in the morning.', 2, NULL, 1, '2020-06-07', 'PAnKGl9G', 'pass123'),
(18, '加油', 2, 6, 1, '2020-06-07', 'null', 'pass123');

-- --------------------------------------------------------

--
-- 表的结构 `contact_form`
--

CREATE TABLE `contact_form` (
  `id` int(11) NOT NULL,
  `firstname` varchar(50) NOT NULL,
  `lastname` varchar(50) NOT NULL,
  `sex` tinyint(1) DEFAULT NULL,
  `wechatid` varchar(50) NOT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `message` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `contact_form`
--

INSERT INTO `contact_form` (`id`, `firstname`, `lastname`, `sex`, `wechatid`, `phone`, `message`) VALUES
(12, 'Tony', 'Stark', 1, 'iamironman', '159876-546-64', 'I think your web page is pretty good.'),
(13, 'Tony', 'Stark', 1, 'iamironman', '159876-546-64', 'I think your web page is pretty good.'),
(14, 'Steve', 'Rogers', 1, 'america', '157952-32468', 'Good job!');

-- --------------------------------------------------------

--
-- 表的结构 `country`
--

CREATE TABLE `country` (
  `code` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `country`
--

INSERT INTO `country` (`code`, `name`) VALUES
('AD', 'Andorra'),
('AE', 'United Arab Emirates'),
('AF', 'Afghanistan'),
('AG', 'Antigua and Barbuda'),
('AI', 'Anguilla'),
('AL', 'Albania'),
('AM', 'Armenia'),
('AO', 'Angola'),
('AQ', 'Antarctica'),
('AR', 'Argentina'),
('AS', 'American Samoa'),
('AT', 'Austria'),
('AU', 'Australia'),
('AW', 'Aruba'),
('AX', 'Åland Islands'),
('AZ', 'Azerbaijan'),
('BA', 'Bosnia and Herzegovina'),
('BB', 'Barbados'),
('BD', 'Bangladesh'),
('BE', 'Belgium'),
('BF', 'Burkina Faso'),
('BG', 'Bulgaria'),
('BH', 'Bahrain'),
('BI', 'Burundi'),
('BJ', 'Benin'),
('BL', 'Saint Barthélemy'),
('BM', 'Bermuda'),
('BN', 'Brunei Darussalam'),
('BO', 'Bolivia (Plurinational State of)'),
('BQ', 'Bonaire - Sint Eustatius and Saba'),
('BR', 'Brazil'),
('BS', 'Bahamas'),
('BT', 'Bhutan'),
('BV', 'Bouvet Island'),
('BW', 'Botswana'),
('BY', 'Belarus'),
('BZ', 'Belize'),
('CA', 'Canada'),
('CC', 'Cocos (Keeling) Islands'),
('CD', 'Democratic Republic of the Congo'),
('CF', 'Central African Republic'),
('CG', 'Congo'),
('CH', 'Switzerland'),
('CI', 'Côte d\'Ivoire'),
('CK', 'Cook Islands'),
('CL', 'Chile'),
('CM', 'Cameroon'),
('CN', 'China'),
('CO', 'Colombia'),
('CR', 'Costa Rica'),
('CU', 'Cuba'),
('CV', 'Cabo Verde'),
('CW', 'Curaçao'),
('CX', 'Christmas Island'),
('CY', 'Cyprus'),
('CZ', 'Czechia'),
('DE', 'Germany'),
('DJ', 'Djibouti'),
('DK', 'Denmark'),
('DM', 'Dominica'),
('DO', 'Dominican Republic'),
('DZ', 'Algeria'),
('EC', 'Ecuador'),
('EE', 'Estonia'),
('EG', 'Egypt'),
('EH', 'Western Sahara'),
('ER', 'Eritrea'),
('ES', 'Spain'),
('ET', 'Ethiopia'),
('FI', 'Finland'),
('FJ', 'Fiji'),
('FK', 'Falkland Islands (Malvinas)'),
('FM', 'Micronesia (Federated States of)'),
('FO', 'Faroe Islands'),
('FR', 'France'),
('GA', 'Gabon'),
('GB', 'United Kingdom of Great Britain and Northern Ireland'),
('GD', 'Grenada'),
('GE', 'Georgia'),
('GF', 'French Guiana'),
('GG', 'Guernsey'),
('GH', 'Ghana'),
('GI', 'Gibraltar'),
('GL', 'Greenland'),
('GM', 'Gambia'),
('GN', 'Guinea'),
('GP', 'Guadeloupe'),
('GQ', 'Equatorial Guinea'),
('GR', 'Greece'),
('GS', 'South Georgia and the South Sandwich Islands'),
('GT', 'Guatemala'),
('GU', 'Guam'),
('GW', 'Guinea-Bissau'),
('GY', 'Guyana'),
('HK', 'China - Hong Kong Special Administrative Region'),
('HM', 'Heard Island and McDonald Islands'),
('HN', 'Honduras'),
('HR', 'Croatia'),
('HT', 'Haiti'),
('HU', 'Hungary'),
('ID', 'Indonesia'),
('IE', 'Ireland'),
('IL', 'Israel'),
('IM', 'Isle of Man'),
('IN', 'India'),
('IO', 'British Indian Ocean Territory'),
('IQ', 'Iraq'),
('IR', 'Iran (Islamic Republic of)'),
('IS', 'Iceland'),
('IT', 'Italy'),
('JE', 'Jersey'),
('JM', 'Jamaica'),
('JO', 'Jordan'),
('JP', 'Japan'),
('KE', 'Kenya'),
('KG', 'Kyrgyzstan'),
('KH', 'Cambodia'),
('KI', 'Kiribati'),
('KM', 'Comoros'),
('KN', 'Saint Kitts and Nevis'),
('KP', 'Democratic People\'s Republic of Korea'),
('KR', 'Republic of Korea'),
('KW', 'Kuwait'),
('KY', 'Cayman Islands'),
('KZ', 'Kazakhstan'),
('LA', 'Lao People\'s Democratic Republic'),
('LB', 'Lebanon'),
('LC', 'Saint Lucia'),
('LI', 'Liechtenstein'),
('LK', 'Sri Lanka'),
('LR', 'Liberia'),
('LS', 'Lesotho'),
('LT', 'Lithuania'),
('LU', 'Luxembourg'),
('LV', 'Latvia'),
('LY', 'Libya'),
('MA', 'Morocco'),
('MC', 'Monaco'),
('MD', 'Republic of Moldova'),
('ME', 'Montenegro'),
('MF', 'Saint Martin (French Part)'),
('MG', 'Madagascar'),
('MH', 'Marshall Islands'),
('MK', 'The former Yugoslav Republic of Macedonia'),
('ML', 'Mali'),
('MM', 'Myanmar'),
('MN', 'Mongolia'),
('MO', 'China - Macao Special Administrative Region'),
('MP', 'Northern Mariana Islands'),
('MQ', 'Martinique'),
('MR', 'Mauritania'),
('MS', 'Montserrat'),
('MT', 'Malta'),
('MU', 'Mauritius'),
('MV', 'Maldives'),
('MW', 'Malawi'),
('MX', 'Mexico'),
('MY', 'Malaysia'),
('MZ', 'Mozambique'),
('NA', 'Namibia'),
('NC', 'New Caledonia'),
('NE', 'Niger'),
('NF', 'Norfolk Island'),
('NG', 'Nigeria'),
('NI', 'Nicaragua'),
('NL', 'Netherlands'),
('NO', 'Norway'),
('NP', 'Nepal'),
('NR', 'Nauru'),
('NU', 'Niue'),
('NZ', 'New Zealand'),
('OM', 'Oman'),
('PA', 'Panama'),
('PE', 'Peru'),
('PF', 'French Polynesia'),
('PG', 'Papua New Guinea'),
('PH', 'Philippines'),
('PK', 'Pakistan'),
('PL', 'Poland'),
('PM', 'Saint Pierre and Miquelon'),
('PN', 'Pitcairn'),
('PR', 'Puerto Rico'),
('PS', 'State of Palestine'),
('PT', 'Portugal'),
('PW', 'Palau'),
('PY', 'Paraguay'),
('QA', 'Qatar'),
('RE', 'Réunion'),
('RO', 'Romania'),
('RS', 'Serbia'),
('RU', 'Russian Federation'),
('RW', 'Rwanda'),
('SA', 'Saudi Arabia'),
('SB', 'Solomon Islands'),
('SC', 'Seychelles'),
('SD', 'Sudan'),
('SE', 'Sweden'),
('SG', 'Singapore'),
('SH', 'Saint Helena'),
('SI', 'Slovenia'),
('SJ', 'Svalbard and Jan Mayen Islands'),
('SK', 'Slovakia'),
('SL', 'Sierra Leone'),
('SM', 'San Marino'),
('SN', 'Senegal'),
('SO', 'Somalia'),
('SR', 'Suriname'),
('SS', 'South Sudan'),
('ST', 'Sao Tome and Principe'),
('SV', 'El Salvador'),
('SX', 'Sint Maarten (Dutch part)'),
('SY', 'Syrian Arab Republic'),
('SZ', 'Swaziland'),
('TC', 'Turks and Caicos Islands'),
('TD', 'Chad'),
('TF', 'French Southern Territories'),
('TG', 'Togo'),
('TH', 'Thailand'),
('TJ', 'Tajikistan'),
('TK', 'Tokelau'),
('TL', 'Timor-Leste'),
('TM', 'Turkmenistan'),
('TN', 'Tunisia'),
('TO', 'Tonga'),
('TR', 'Turkey'),
('TT', 'Trinidad and Tobago'),
('TV', 'Tuvalu'),
('TW', 'Taiwan'),
('TZ', 'United Republic of Tanzania'),
('UA', 'Ukraine'),
('UG', 'Uganda'),
('UM', 'United States Minor Outlying Islands'),
('US', 'USA'),
('UY', 'Uruguay'),
('UZ', 'Uzbekistan'),
('VA', 'Holy See'),
('VC', 'Saint Vincent and the Grenadines'),
('VE', 'Venezuela (Bolivarian Republic of)'),
('VG', 'British Virgin Islands'),
('VI', 'United States Virgin Islands'),
('VN', 'Viet Nam'),
('VU', 'Vanuatu'),
('WF', 'Wallis and Futuna Islands'),
('WS', 'Samoa'),
('YE', 'Yemen'),
('YT', 'Mayotte'),
('ZA', 'South Africa'),
('ZM', 'Zambia'),
('ZW', 'Zimbabwe');

-- --------------------------------------------------------

--
-- 表的结构 `covid_map`
--

CREATE TABLE `covid_map` (
  `id` int(11) NOT NULL,
  `pid` int(11) NOT NULL,
  `date` date NOT NULL,
  `placename` varchar(255) NOT NULL,
  `confirm` int(11) DEFAULT 0,
  `cured` int(11) DEFAULT 0,
  `death` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `covid_map`
--

INSERT INTO `covid_map` (`id`, `pid`, `date`, `placename`, `confirm`, `cured`, `death`) VALUES
(4978, 1, '2020-06-13', '阿富汗\n', 22890, 0, 426),
(4979, 2, '2020-06-13', '安哥拉\n', 118, 0, 5),
(4980, 3, '2020-06-13', '阿尔巴尼亚\n', 1385, 0, 35),
(4981, 4, '2020-06-13', '阿拉伯联合酋长国\n', 40986, 0, 286),
(4982, 5, '2020-06-13', '阿根廷\n', 27373, 0, 765),
(4983, 6, '2020-06-13', '亚美尼亚\n', 14669, 0, 245),
(4984, 7, '2020-06-13', '法属南部群岛\n', 1, 0, 0),
(4985, 8, '2020-06-13', '澳大利亚\n', 7289, 0, 102),
(4986, 9, '2020-06-13', '奥地利\n', 17034, 0, 674),
(4987, 10, '2020-06-13', '阿塞拜疆\n', 8882, 0, 108),
(4988, 11, '2020-06-13', '布隆迪\n', 85, 0, 1),
(4989, 12, '2020-06-13', '比利时\n', 59711, 0, 9636),
(4990, 13, '2020-06-13', '贝宁\n', 305, 0, 4),
(4991, 14, '2020-06-13', '布吉纳法索\n', 892, 0, 53),
(4992, 15, '2020-06-13', '孟加拉国\n', 78052, 0, 1049),
(4993, 16, '2020-06-13', '保加利亚\n', 3086, 0, 168),
(4994, 17, '2020-06-13', '巴哈马群岛\n', 103, 0, 11),
(4995, 18, '2020-06-13', '波斯尼亚和黑塞哥维那\n', 2832, 0, 161),
(4996, 19, '2020-06-13', '白俄罗斯\n', 51816, 0, 293),
(4997, 20, '2020-06-13', '伯利兹\n', 20, 0, 2),
(4998, 21, '2020-06-13', '百慕大\n', 141, 0, 9),
(4999, 22, '2020-06-13', '玻利维亚\n', 16165, 0, 533),
(5000, 23, '2020-06-13', '巴西\n', 802828, 0, 40919),
(5001, 24, '2020-06-13', '文莱\n', 141, 0, 2),
(5002, 25, '2020-06-13', '不丹\n', 62, 0, 0),
(5003, 26, '2020-06-13', '博茨瓦纳\n', 48, 0, 1),
(5004, 27, '2020-06-13', '中非共和国\n', 1952, 0, 5),
(5005, 28, '2020-06-13', '加拿大\n', 99159, 0, 8071),
(5006, 29, '2020-06-13', '瑞士\n', 31044, 0, 1937),
(5007, 30, '2020-06-13', '智利\n', 154092, 0, 2648),
(5008, 31, '2020-06-13', '中国\n', 84216, 0, 4638),
(5009, 32, '2020-06-13', '科特迪瓦\n', 4404, 0, 41),
(5010, 33, '2020-06-13', '喀麦隆\n', 8681, 0, 212),
(5011, 34, '2020-06-13', '刚果民主共和国\n', 4515, 0, 98),
(5012, 35, '2020-06-13', '刚果共和国\n', 728, 0, 24),
(5013, 36, '2020-06-13', '哥伦比亚\n', 43810, 0, 1505),
(5014, 37, '2020-06-13', '哥斯达黎加\n', 1538, 0, 12),
(5015, 38, '2020-06-13', '古巴\n', 2219, 0, 84),
(5016, 39, '2020-06-13', '北塞浦路斯\n', 0, 0, 0),
(5017, 40, '2020-06-13', '塞浦路斯\n', 975, 0, 18),
(5018, 41, '2020-06-13', '捷克共和国\n', 9855, 0, 328),
(5019, 42, '2020-06-13', '德国\n', 186691, 0, 8772),
(5020, 43, '2020-06-13', '吉布提\n', 4398, 0, 37),
(5021, 44, '2020-06-13', '丹麦\n', 12222, 0, 593),
(5022, 45, '2020-06-13', '多米尼加共和国\n', 21455, 0, 561),
(5023, 46, '2020-06-13', '阿尔及利亚\n', 10589, 0, 741),
(5024, 47, '2020-06-13', '厄瓜多尔\n', 44440, 0, 3720),
(5025, 48, '2020-06-13', '埃及\n', 39726, 0, 1377),
(5026, 49, '2020-06-13', '厄立特里亚\n', 41, 0, 0),
(5027, 50, '2020-06-13', '西班牙\n', 242707, 0, 27136),
(5028, 51, '2020-06-13', '爱沙尼亚\n', 1965, 0, 69),
(5029, 52, '2020-06-13', '埃塞俄比亚\n', 2670, 0, 40),
(5030, 53, '2020-06-13', '芬兰\n', 7064, 0, 325),
(5031, 54, '2020-06-13', '斐济\n', 18, 0, 0),
(5032, 55, '2020-06-13', '福克兰群岛\n', 13, 0, 0),
(5033, 56, '2020-06-13', '法国\n', 191554, 0, 29347),
(5034, 57, '2020-06-13', '加蓬\n', 3463, 0, 23),
(5035, 58, '2020-06-13', '英国\n', 292706, 0, 41355),
(5036, 59, '2020-06-13', '乔治亚州\n', 831, 0, 13),
(5037, 60, '2020-06-13', '加纳\n', 10358, 0, 48),
(5038, 61, '2020-06-13', '几内亚\n', 4372, 0, 23),
(5039, 62, '2020-06-13', '冈比亚\n', 28, 0, 1),
(5040, 63, '2020-06-13', '几内亚比绍\n', 1389, 0, 12),
(5041, 64, '2020-06-13', '赤道几内亚\n', 1306, 0, 12),
(5042, 65, '2020-06-13', '希腊\n', 3088, 0, 183),
(5043, 66, '2020-06-13', '格陵兰岛\n', 13, 0, 0),
(5044, 67, '2020-06-13', '危地马拉\n', 8561, 0, 334),
(5045, 68, '2020-06-13', '法属圭亚那\n', 917, 0, 2),
(5046, 69, '2020-06-13', '圭亚那\n', 158, 0, 12),
(5047, 70, '2020-06-13', '洪都拉斯\n', 7669, 0, 294),
(5048, 71, '2020-06-13', '克罗地亚\n', 2249, 0, 106),
(5049, 72, '2020-06-13', '海地\n', 3941, 0, 64),
(5050, 73, '2020-06-13', '匈牙利\n', 4039, 0, 553),
(5051, 74, '2020-06-13', '印尼\n', 35295, 0, 2000),
(5052, 75, '2020-06-13', '印度\n', 297535, 0, 8498),
(5053, 76, '2020-06-13', '爱尔兰\n', 25238, 0, 1703),
(5054, 77, '2020-06-13', '伊朗\n', 180156, 0, 8584),
(5055, 78, '2020-06-13', '伊拉克\n', 16675, 0, 457),
(5056, 79, '2020-06-13', '冰岛\n', 1807, 0, 10),
(5057, 80, '2020-06-13', '以色列\n', 18569, 0, 300),
(5058, 81, '2020-06-13', '意大利\n', 236142, 0, 34167),
(5059, 82, '2020-06-13', '牙买加\n', 611, 0, 10),
(5060, 83, '2020-06-13', '约旦\n', 890, 0, 9),
(5061, 84, '2020-06-13', '日本\n', 17187, 0, 922),
(5062, 85, '2020-06-13', '哈萨克斯坦\n', 13872, 0, 67),
(5063, 86, '2020-06-13', '肯尼亚\n', 3215, 0, 92),
(5064, 87, '2020-06-13', '吉尔吉斯斯坦\n', 2166, 0, 26),
(5065, 88, '2020-06-13', '柬埔寨\n', 126, 0, 0),
(5066, 89, '2020-06-13', '韩国\n', 12003, 0, 277),
(5067, 90, '2020-06-13', '科索沃\n', 1326, 0, 31),
(5068, 91, '2020-06-13', '科威特\n', 34432, 0, 279),
(5069, 92, '2020-06-13', '老挝\n', 19, 0, 0),
(5070, 93, '2020-06-13', '黎巴嫩\n', 1402, 0, 31),
(5071, 94, '2020-06-13', '利比里亚\n', 410, 0, 31),
(5072, 95, '2020-06-13', '利比亚\n', 393, 0, 5),
(5073, 96, '2020-06-13', '斯里兰卡\n', 1877, 0, 11),
(5074, 97, '2020-06-13', '莱索托\n', 4, 0, 0),
(5075, 98, '2020-06-13', '立陶宛\n', 1752, 0, 74),
(5076, 99, '2020-06-13', '卢森堡\n', 4052, 0, 110),
(5077, 100, '2020-06-13', '拉脱维亚\n', 1094, 0, 26),
(5078, 101, '2020-06-13', '摩洛哥\n', 8537, 0, 211),
(5079, 102, '2020-06-13', '摩尔多瓦\n', 10727, 0, 375),
(5080, 103, '2020-06-13', '马达加斯加\n', 1203, 0, 10),
(5081, 104, '2020-06-13', '墨西哥\n', 133974, 0, 15944),
(5082, 105, '2020-06-13', '马其顿\n', 3538, 0, 169),
(5083, 106, '2020-06-13', '马里\n', 1722, 0, 97),
(5084, 107, '2020-06-13', '马耳他\n', 640, 0, 9),
(5085, 108, '2020-06-13', '缅甸\n', 260, 0, 6),
(5086, 109, '2020-06-13', '黑山共和国\n', 324, 0, 9),
(5087, 110, '2020-06-13', '蒙古\n', 197, 0, 0),
(5088, 111, '2020-06-13', '莫桑比克\n', 489, 0, 2),
(5089, 112, '2020-06-13', '毛利塔尼亚\n', 1439, 0, 74),
(5090, 113, '2020-06-13', '马拉维\n', 481, 0, 4),
(5091, 114, '2020-06-13', '马来西亚\n', 8369, 0, 118),
(5092, 115, '2020-06-13', '纳米比亚\n', 31, 0, 0),
(5093, 116, '2020-06-13', '新喀里多尼亚\n', 21, 0, 0),
(5094, 117, '2020-06-13', '尼日尔\n', 974, 0, 65),
(5095, 118, '2020-06-13', '尼日利亚\n', 14554, 0, 387),
(5096, 119, '2020-06-13', '尼加拉瓜\n', 1464, 0, 55),
(5097, 120, '2020-06-13', '荷兰\n', 48458, 0, 6063),
(5098, 121, '2020-06-13', '挪威\n', 8608, 0, 242),
(5099, 122, '2020-06-13', '尼泊尔\n', 4614, 0, 15),
(5100, 123, '2020-06-13', '新西兰\n', 1504, 0, 22),
(5101, 124, '2020-06-13', '阿曼\n', 19954, 0, 89),
(5102, 125, '2020-06-13', '巴基斯坦\n', 125933, 0, 2463),
(5103, 126, '2020-06-13', '巴拿马\n', 18586, 0, 418),
(5104, 127, '2020-06-13', '秘鲁\n', 214788, 0, 6088),
(5105, 128, '2020-06-13', '菲律宾\n', 24175, 0, 1036),
(5106, 129, '2020-06-13', '巴布新几内亚\n', 8, 0, 0),
(5107, 130, '2020-06-13', '波兰\n', 28201, 0, 1215),
(5108, 131, '2020-06-13', '波多黎各\n', 0, 0, 0),
(5109, 132, '2020-06-13', '朝鲜\n', 0, 0, 0),
(5110, 133, '2020-06-13', '葡萄牙\n', 35910, 0, 1504),
(5111, 134, '2020-06-13', '巴拉圭\n', 1230, 0, 11),
(5112, 135, '2020-06-13', '卡塔尔\n', 75071, 0, 69),
(5113, 136, '2020-06-13', '罗马尼亚\n', 21182, 0, 1369),
(5114, 137, '2020-06-13', '俄罗斯\n', 501800, 0, 6522),
(5115, 138, '2020-06-13', '卢旺达\n', 494, 0, 2),
(5116, 139, '2020-06-13', '西撒哈拉\n', 9, 0, 1),
(5117, 140, '2020-06-13', '沙特阿拉伯\n', 116021, 0, 857),
(5118, 141, '2020-06-13', '苏丹\n', 6730, 0, 413),
(5119, 142, '2020-06-13', '南苏丹\n', 1670, 0, 24),
(5120, 143, '2020-06-13', '塞内加尔\n', 4759, 0, 55),
(5121, 144, '2020-06-13', '所罗门群岛\n', 0, 0, 0),
(5122, 145, '2020-06-13', '塞拉利昂\n', 1085, 0, 50),
(5123, 146, '2020-06-13', '萨尔瓦多\n', 3373, 0, 68),
(5124, 147, '2020-06-13', '索马里兰\n', 2513, 0, 85),
(5125, 148, '2020-06-13', '索马里\n', 0, 0, 0),
(5126, 149, '2020-06-13', '塞尔维亚共和国\n', 12102, 0, 252),
(5127, 150, '2020-06-13', '苏里南\n', 168, 0, 2),
(5128, 151, '2020-06-13', '斯洛伐克\n', 1541, 0, 28),
(5129, 152, '2020-06-13', '斯洛文尼亚\n', 1488, 0, 109),
(5130, 153, '2020-06-13', '瑞典\n', 48288, 0, 4814),
(5131, 154, '2020-06-13', '斯威士兰\n', 0, 0, 0),
(5132, 155, '2020-06-13', '叙利亚\n', 164, 0, 6),
(5133, 156, '2020-06-13', '乍得\n', 848, 0, 72),
(5134, 157, '2020-06-13', '多哥\n', 524, 0, 13),
(5135, 158, '2020-06-13', '泰国\n', 3125, 0, 58),
(5136, 159, '2020-06-13', '塔吉克斯坦\n', 4834, 0, 49),
(5137, 160, '2020-06-13', '土库曼斯坦\n', 0, 0, 0),
(5138, 161, '2020-06-13', '东帝汶\n', 24, 0, 0),
(5139, 162, '2020-06-13', '特立尼达和多巴哥\n', 117, 0, 8),
(5140, 163, '2020-06-13', '突尼斯\n', 1087, 0, 49),
(5141, 164, '2020-06-13', '土耳其\n', 174023, 0, 4763),
(5142, 165, '2020-06-13', '中国台湾\n', 443, 0, 7),
(5143, 166, '2020-06-13', '坦桑尼亚联合共和国\n', 509, 0, 21),
(5144, 167, '2020-06-13', '乌干达\n', 679, 0, 0),
(5145, 168, '2020-06-13', '乌克兰\n', 29706, 0, 864),
(5146, 169, '2020-06-13', '乌拉圭\n', 847, 0, 23),
(5147, 170, '2020-06-13', '美国\n', 2023590, 0, 113823),
(5148, 171, '2020-06-13', '乌兹别克斯坦\n', 4741, 0, 19),
(5149, 172, '2020-06-13', '委内瑞拉\n', 2814, 0, 23),
(5150, 173, '2020-06-13', '越南\n', 332, 0, 0),
(5151, 174, '2020-06-13', '瓦努阿图\n', 0, 0, 0),
(5152, 175, '2020-06-13', '约旦河西岸与加沙地区\n', 487, 0, 3),
(5153, 176, '2020-06-13', '也门\n', 591, 0, 136),
(5154, 177, '2020-06-13', '南非\n', 58568, 0, 1284),
(5155, 178, '2020-06-13', '赞比亚\n', 63429, 0, 220),
(5156, 179, '2020-06-13', '津巴布韦\n', 1044, 0, 17);

-- --------------------------------------------------------

--
-- 表的结构 `cov_news`
--

CREATE TABLE `cov_news` (
  `id` int(11) NOT NULL,
  `pubDate` varchar(225) DEFAULT NULL,
  `title` varchar(225) DEFAULT NULL,
  `summary` varchar(2000) DEFAULT NULL,
  `infoSource` varchar(225) DEFAULT NULL,
  `sourceUrl` varchar(225) DEFAULT NULL,
  `image` varchar(512) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `cov_news`
--

INSERT INTO `cov_news` (`id`, `pubDate`, `title`, `summary`, `infoSource`, `sourceUrl`, `image`) VALUES
(43700, '2023/11/20 15:40', '日本第三轮核污染水排海结束 累计排放量超2.3万吨', '据日本广播协会(NHK)当地时间20日报道，东京电力公司称，福岛第一核电站第三轮核污染水排海已于当天中午左右结束。\n　　本次排放自11月2日开始，总排放量为7753吨。第四轮排海预计将于明年年初开始，四次排放总排放量约为3.12万吨，目前已排放2.3351万吨。(央视新闻客户端 总台报道员 林博翰)', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/11-20/10114937.shtml', 'https://qnimg.zhaibian.com/upload/20220324/b3cdc893ddc6157bb3d15a2e2bb22d4e.jpg'),
(43701, '2023/11/20 13:22', '国际热评：超2.3万吨核污水全部入海 日本，请住手！', '中新网11月20日电 (张奥林)11月20日，福岛核电站第三批次核污水排放结束，从8月24日正式开启排污，不到三个月的时间，已有超2.3万吨核污水流入太平洋。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/11-20/10114844.shtml', 'https://k.sinaimg.cn/n/sjzx/crawl/85/w550h335/20210413/31dc-knqqqmv1007208.jpg/w700h350z1l10t10fd3.jpg'),
(43702, '2023/11/17 17:04', '习近平会见日本首相岸田文雄', '中新社旧金山11月16日电 (记者 郭金超 梁晓辉)当地时间11月16日下午，中国国家主席习近平在旧金山会见日本首相岸田文雄。\n　　两国领导人重申恪守中日四个政治文件的原则和共识，重新确认全面推进战略互惠关系的两国关系定位，致力于构建契合新时代要求的建设性、稳定的中日关系。\n　　习近平指出，今年是中日和平友好条约缔结45周年，条约以法律形式确立了中日和平、友好、合作的大方向，成为两国关系史上的里程碑。45年来，在包括条约在内的中日四个政治文件指引下，两国关系尽管历经风雨，但总体保持发展势头，给两国人民带来福祉，也为促进地区和平、发展、繁荣发挥了积极作用。当前国际形势变乱交织，风险挑战层出不穷，中日和平共处、世代友好、互利合作、共同发展，符合两国人民根本利益。当前，中日关系正处于承前启后的关键时期，双方应该顺应时代潮流，把握正确方向，本着“以史为鉴、开辟未来”的精神，保持邦交正常化初心，客观理性看待彼此发展，树立积极友善相互认知，建设性管控矛盾分歧，将“互为合作伙伴、互不构成威胁”的政治共识体现到具体政策和实际行动中。', '中国新闻网', 'https://www.chinanews.com.cn/gn/2023/11-17/10113776.shtml', 'https://www.chinanews.com/gn/shipin/2023/11-17/U574P883T4D975666F158DT20231117164806.jpg'),
(43703, '2023/12/18 20:25', '日本将于2024年2月启动第四轮核污染水排海 总量7800吨', '中新网12月18日电 据日本放送协会(NHK)报道，日本东京电力公司18日表示，福岛第一核电站第四轮核污染水排海将于2024年2月下旬开始，排海总量预计为7800吨，预计将于3月结束。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/12-18/10130857.shtml', 'https://i2.chinanews.com.cn/simg/cmshd/2023/12/18/d957f36fa55149efb53efc75b13b7439.jpg'),
(43704, '2023/12/13 16:18', '福岛第一核电站一名工作人员被放射性物质污染 中方回应', '毛宁：我也注意到有关报道。日本福岛第一核电站退役、核污染水处置过程中，接连发生工作人员遭受核污染水溅射、放射性物质污染等事故，充分说明问题的严重性，也再次证明妥善处理核污染水的极端重要性。\n日方核污染水排海计划长达30年甚至更久，存在巨大的风险隐患。中方敦促日方重视各利益攸关方的关切，全面配合建立各方实质参与、长期有效的国际监测安排，切实防止排海对海洋环境和人类健康造成长期危害。', '中国新闻网', 'https://www.chinanews.com.cn/gn/2023/12-13/10127693.shtml', 'https://ts1.cn.mm.bing.net/th/id/R-C.029804ec17ffd7bf3a85f1c2a714bdac?rik=02ODbP8DTlPlog&riu=http%3a%2f%2fimg2.zjolcdn.com%2fpic%2f0%2f14%2f02%2f75%2f14027522_976773.jpg&ehk=yUmxGYThrklWrMYh4PHWiP99YVl4eETkA8Rfxtf94wg%3d&risl=&pid=ImgRaw&r=0'),
(43705, '2023/12/11 21:10', '日本福岛第一核电站一名废炉作业工人遭放射性物质污染', '据日本《朝日新闻》报道，东京电力公司11日发布消息称，在福岛第一核电站内进行废炉作业的一名工人面部受到放射性物质污染。\n　　东电公司称，遭放射性物质污染的工人为一名20多岁的男子，当日在福岛第一核电站2号机组附近对已解体的围栏进行除污作业。他在除污作业结束后，被发现鼻腔受到了放射性物质污染，其体内可能吸入了放射性物质。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/12-11/10126580.shtml', 'https://ts1.cn.mm.bing.net/th/id/R-C.f69316aade623bcec37babe043b9716a?rik=yVYTZX2To7Wrpw&riu=http%3a%2f%2fhimg2.huanqiu.com%2fattachment2010%2f2013%2f1108%2f20131108090938130.jpg&ehk=%2fZUbKCsoz2uUmnFKNTrnaPg4kB0aOWUTG%2fm8dgJW%2fUU%3d&risl=&pid=ImgRaw&r=0'),
(43706, '2023/11/28 15:54', '中方：日方应认真对待利益攸关方要求进行损害认定与赔偿的正当诉求', '中新网北京11月28日电 (记者 黄钰钦)中国外交部发言人汪文斌28日主持例行记者会。\n　　有记者提问：据报道，在日本政府启动福岛核污染水排海3个月之际，东京电力公司近日面向日本国内福岛核污染水排海受害者启动了损害认定和赔偿。发言人对此有何评论？\n　　汪文斌：日本福岛核污染水排海事关全人类健康、全球海洋环境、国际公共利益。日方不仅应当严肃对待国内民众关切，同样应当正视国际社会特别是周边邻国的强烈担忧，本着负责任和建设性的态度同利益攸关方进行沟通，认真对待利益攸关方要求进行损害认定与赔偿的正当诉求。', '中国新闻网', 'https://www.chinanews.com.cn/gn/2023/11-28/10119144.shtml', 'https://tse4-mm.cn.bing.net/th/id/OIP-C.PoyySbBcrV7hDlFklmdZLAHaEg?rs=1&pid=ImgDetMain'),
(43707, '2023/11/27 05:39', '内外抗议声不断 日方应配合建立长期有效国际监测安排', '11月20日，东京电力公司(以下简称东电)发布消息称，已经完成第三轮核污染水排放，第四轮将在明年初实施。按照计划，东电在2024年3月底前共进行四轮排放，共计排放3.12万吨核污染水。自8月24日正式启动核污染水排海以来，日本国内外反对抗议持续，不断暴露的事故和问题也进一步加重了国际社会的担忧。事实证明，东电管理体制存在漏洞，日方宣称的“安全、透明”的排海计划不能令人信服。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/11-27/10118372.shtml', 'https://www.whb.cn/u/cms/www/202303/13235432rokm.JPG'),
(43708, '2023/11/25 05:52', '中国代表敦促日本全面配合接受严格国际监督', '中新社柏林11月24日电 　维也纳消息：中国常驻国际原子能机构代表李松大使24日在国际原子能机构11月理事会上发言，重申中方坚决反对日本福岛核污染水排海，敦促日方全面配合接受严格国际监督。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/11-25/10117721.shtml', 'https://i2.chinanews.com.cn/simg/ypt/2023/231125/4151933c-5b6b-4036-bd90-896f0f95534e_zsite.jpg'),
(43709, '2023/11/23 15:51', '福岛核污染水排海已三个月 中方：国际社会迫切要求建立长期有效的国际监测安排', '中新网北京11月23日电  (记者 李京泽)中国外交部发言人毛宁23日主持例行记者会。\n　　有记者提问：东京电力公司排放核污染水已经三个月，中方对此如何评论？\n　　毛宁：中方反对福岛核污染水排海的立场是一贯的，也是很明确的。我们认为，日本福岛核污染水排海事关人类健康、事关全球海洋环境、事关国际公共利益。日方应当严肃对待国内外的合理关切，本着负责任和建设性的态度妥善处理。', '中国新闻网', 'https://www.chinanews.com.cn/gn/2023/11-23/10116731.shtml', 'https://www.chinanews.com.cn/gn/2023/11-23/U422P4T8D10116731F107DT20231123163234.jpg'),
(43713, '2023/11/17 17:04', '日本首相要求中方取消禁止从日本进口食品的措施 外交部回应', '另有记者提问：日本首相岸田文雄在美国旧金山和习近平主席会见的时候，明确要求，中方立即取消禁止从日本进口食品的措施。发言人对此有何评论？\n　　毛宁：习近平主席在会见日本首相岸田文雄的时候指出，日本福岛核污染水排海事关全人类健康、全球海洋环境、国际公共利益，日方应该严肃对待国内外的合理关切，本着负责任和建设性的态度妥善处理。', '中国新闻网', 'https://www.chinanews.com.cn/gn/2023/11-17/10113734.shtml', 'https://i2.chinanews.com.cn/simg/cmshd/2023/11/17/1e9e144009a741ee924c41c7a90d54d4.jpg'),
(43714, '2023/11/10 08:19', '王毅会见日本内阁特别顾问、国家安全保障局长秋叶刚男', '2023年11月9日，中共中央政治局委员、中央外办主任王毅在北京会见日本内阁特别顾问、国家安全保障局长秋叶刚男并举行中日高级别政治对话机制磋商。\n　　王毅阐明了中方对当前中日关系的原则立场，指出了改善和发展中日关系的正确路径。\n　　双方重申恪守中日四个政治文件确定的各项原则，努力推动两国关系重回健康稳定发展轨道。双方同意继续就此保持沟通。', '中国新闻网', 'https://www.chinanews.com.cn/gn/2023/11-10/10109523.shtml', 'https://thepaper-prod-oldimagefromnfs.oss-cn-shanghai.aliyuncs.com/image/10/13/787.jpg'),
(43715, '2023/11/08 11:13', '王毅同志在第四届“海洋合作与治理论坛”开幕式上的致辞', '各位来宾，各位朋友：\n　　大家好！很高兴出席第四届海洋合作与治理论坛开幕式。首先，我谨代表中国政府对论坛的成功召开表示热烈祝贺，向出席论坛的各国和国际组织代表、专家学者、媒体朋友们表示热烈欢迎！\n　　海洋是人类赖以生存发展的重要基础，也是文明交流互鉴的天然平台，加强海洋合作，完善海洋治理，反映了各国的共同愿望，也是时代的大势所趋。与此同时，当今世界并不太平，海洋的发展正面临前所未有的风险挑战。我们看到，冷战思维、零和博弈威胁着海洋的和平稳定，气候变化、过度开发损害着海洋的持续发展，环境污染、随意排放破坏着海洋的清洁美丽，自然灾害、海盗犯罪扰乱着海洋的安宁秩序。', '中国新闻网', 'https://www.chinanews.com.cn/gn/2023/11-08/10108150.shtml', 'https://ts1.cn.mm.bing.net/th/id/R-C.d12483ed57161f5655b508947a583bb9?rik=%2bjNYgmTAZR6g9A&riu=http%3a%2f%2fwww.nanhai.org.cn%2fuploads%2fimage%2f20211109%2f1636466039343977.jpg&ehk=65uthAEvPzXAIEbMTcwn%2fWDeZ8thttdyjg1U0BZLhZc%3d&risl=&pid=ImgRaw&r=0'),
(43716, '2023/11/05 22:37', '中国生态环境部部长：坚决反对日本单方面启动核污染水排海行动', '中新社北京11月5日电 中国生态环境部部长黄润秋在第二十四次中日韩环境部长会议上强调，海洋是全人类共同的财产。核污染水处置关乎全球海洋生态环境和民众健康。日方应忠实履行本国的国际义务，同邻国等利益攸关方充分协商，以科学、负责任方式处置核污染水。', '中国新闻网', 'https://www.chinanews.com.cn/gn/2023/11-05/10106580.shtml', 'https://image.01icon.com/media/images/dw/20230205/699036881475604480852379.jpeg?w=660'),
(43717, '2023/11/04 22:06', '亚太观察丨日本启动第三轮核污染水排海', '日本东京电力公司11月2日启动第三轮核污染水排海，预计将持续到11月20日，排放量约为7800吨。而就在此前的10月25日，福岛第一核电站发生放射性废液溅射事件，处理核污染水的5名工作人员接触到放射性废液，其中2人被紧急送医。东电公司最初公布称，溅射的放射性废液量仅为100毫升，但数日后却进行订正称，溅出的废液量达数升之多，比最初的数据高出几十倍。此次事故，在日本社会备受关注。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/11-04/10106159.shtml', 'https://ugc-img.ifengimg.com/img/2021/12/23/8CCh5enSMyJ/4ed42252-5cf3-4991-9cac-71df82c3eb09_w483_h322.jpeg'),
(43718, '2023/11/04 16:00', '亚太观察丨长期管理混乱 对公众欺瞒推责 日本东电痼疾积重难返', '近日，日本福岛第一核电站发生的放射性废液溅射事件再次表明，东京电力公司长期存在的内部管理混乱无序、对公众隐瞒欺骗等痼疾积重难返。\n　　事实上，福岛核事故发生12年来，东电善后处理漏洞百出，迟报、瞒报事件频繁发生。对于因核事故而罹患癌症等严重疾病的日本民众，东电也始终是在推卸责任。从核污染水排海到所谓计划中的福岛第一核电站拆除，按照日本政府和东电的说法，将持续数十年的时间。而一直以来，福岛核事故善后工作的混乱和无序让不少日本民众对福岛核事故今后的处理充满担忧。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/11-04/10105988.shtml', 'https://n.sinaimg.cn/sinakd20230205s/107/w1024h683/20230205/b0e7-20e3e83a0721a3fc9193ba93410437b7.jpg'),
(43719, '2023/11/04 09:10', '新漫评：日本又排“祸水” 再造地球之殇', '11月2日，日本正式开始排放第三批福岛核污水，预计将持续17天。此次的排放量与前两次大致相同，仍为7800吨左右。这也意味着，第三批的排放结束后，流入太平洋的核污水累计将超过2.3万吨。\n　　据日本放送协会(NHK)，7800吨相当于10个核污染水储水罐的量，在2011年福岛核事故之后，当地已经修建了1000多个储水罐。有数据显示，在正式排污开始前，福岛核污染水已存到了130万吨，要把这些水全部排完，至少需要30年。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/11-04/10105872.shtml', 'https://i2.chinanews.com.cn/simg/cmshd/2023/11/04/c7bbb4b31ab34db09581352895040095.jpg'),
(43720, '2023/11/03 16:03', '国际锐评丨这起事故戳穿了日方关于核污染水的两个谎言', '不顾国内外强烈反对，日本东京电力公司2日启动了福岛核污染水第三次排海作业。这次排放预计持续到本月20日，排放量约为7800吨。东电公司声称，排放的核污染水“所含放射性物质氚的浓度符合预期”。然而，一周前，这家声名狼藉的企业发生了一起放射性废液溅射污染事故，2名工作人员被紧急送医。这自证了日方所谓核污染水“安全”的说辞绝不可信，核污染水处置过程中的风险不容低估。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/11-03/10105485.shtml', 'https://www.ccnta.cn/uploadfile/2021/1216/20211216100342107.jpg'),
(43721, '2023/11/02 18:41', '中国驻日使馆发言人就日本启动第三批福岛核污染水排海答记者问', '中新网东京11月2日电  中国驻日本使馆发言人11月2日就日本启动第三批福岛核污染水排海答记者问。\n　　有记者问，11月2日，东京电力公司启动第三批福岛核污染水排海，请问你对此有何评论？\n　　发言人表示，日方连续倾倒核污染水，给全球海洋环境安全造成重大风险。中方反对日本福岛核污染水排海的立场是明确和坚定的。我们再次敦促日方全面回应国际社会关切，接受利益攸关方充分实质参与、长期有效的国际监测安排，切实以科学、安全、透明方式处置核污染水。', '中国新闻网', 'https://www.chinanews.com.cn/gn/2023/11-02/10105074.shtml', 'https://tse2-mm.cn.bing.net/th/id/OIP-C.GYjknyM7-4m5PORDynMwQwAAAA?rs=1&pid=ImgDetMain'),
(43722, '2023/11/02 17:16', '日本启动第三批核污染水排海 民众持续集会反对', '据日本《产经新闻》报道，第三批排放的核污染水总量为7800吨左右，与第一批、第二批核污染水的排放量相当。第三批核污染水预计在11月20日完成排放。东京电力公司计划在2023年度排放总计3.12万吨核污染水。\n　　当地时间11月1日晚，日本多个市民团体再度在东京电力公司总部前集会，强烈反对东京电力公司启动第三批核污染水排海。活动组织方代表柳田真在现场表示，日本政府和东京电力公司以推进福岛第一核电站核电机组退役为由强行将核污染水排海，是“彻头彻尾的谎言”。核电机组退役工作至今没有明确的路线图和时间表。', '中国新闻网', 'https://www.chinanews.com.cn/gj/2023/11-02/10105035.shtml', 'https://imagecloud.thepaper.cn/thepaper/image/212/438/197.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `cov_research`
--

CREATE TABLE `cov_research` (
  `id` int(11) NOT NULL,
  `title` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `summary` varchar(2000) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `url` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `date` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `image` mediumblob DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `cov_research`
--

INSERT INTO `cov_research` (`id`, `title`, `summary`, `url`, `date`, `image`) VALUES
(1, '切尔诺贝利核事故幸存者子女并无过多新发突变', '2021年4月22日，《科学》发表两篇论文，乌克兰国家辐射医学研究中心和美国国家癌症研究所的研究人员对切尔诺贝利事故幸存者及其后代的基因组进行了研究，他们没有发现辐射影响跨代效应的证据。', 'https://paper.sciencenet.cn/htmlpaper/2021/4/202142813444765763097.shtm', '2021/4/26', 0x68747470733a2f2f7777772e736369656e63652e6f72672f636d732f31302e313132362f736369656e63652e616267323533382f61737365742f63613736626238652d616138342d343062612d623033362d6561393965366164633064612f6173736574732f677261706869632f3337325f616267323533385f66612e6a706567),
(2, '中国核技术应用产业发展报告（2023）核心报告', '为切实推进我国核技术应用产业高质量发展，2022年4月，中国核能行业协会启动首份《中国核技术应用产业发展报告(2023)》(简称《产业发展报告》)的编撰工作，并邀请219余位长期从事核技术应用产业化工作的专家、学者和企业家组建编写及评审团队。全体编评人员克服困难，秉持客观、公正、专业精神，形成了80多万字的首份《产业发展报告》。报告全面扫描全球核技术应用产业发展大势，聚焦分析我国核技术应用产业的政策环境、市场规模及前景、发展动力、骨干企业、竞争格局、制约因素及发展瓶颈，并提出对策建议。报告包括总体发展、技术与产业、典型案例三个篇章。我们相信，《产业发展报告》 将有助于促进我国核技术应用产业技术、资本、人才和市场等要素间的高效衔接和深度迭代，有助于政府部门决策、行业改善管理、市场投资优化、企业技术创新、应用业态拓展，并给企业家、创业家、投资人、消费者及相关从业人员等提供十分有价值的参考。', 'https://nnsa.mee.gov.cn/ywdt/hyzx/202307/t20230720_1036784.html', '2023/07/20', 0x68747470733a2f2f6e6e73612e6d65652e676f762e636e2f696d616765732f4e4e53415f626173655f76323031395f30372e706e67),
(3, '辐射损伤后唾液腺中的CSF1R依赖性巨噬细胞对上皮再生至关重要', '放射治疗是治疗头颈癌的有效方法，但副作用广泛，包括慢性口干。McKendrick 等人。研究了巨噬细胞在唾液腺中的作用，以更好地了解它们对辐射的反应以及如何靶向恢复它们的功能。他们在成年小鼠的唾液腺中鉴定了两个转录不同的CX3CR1巨噬细胞亚群。腺体上皮富集CD11cCD206++–CD163型–巨噬细胞，而 CD11c–CD206CD163巨噬细胞定位于血管和神经。辐射诱导的唾液腺损伤小鼠模型证实，这种治疗改变了该部位巨噬细胞亚群的组成和寿命，但上皮相关的CD11cCD206+++–CD163型–巨噬细胞是损伤后上皮细胞再生所必需的。这些发现提供了对唾液腺对辐射反应的见解，并可以指导未来的治疗。——克里斯蒂安娜·福格', 'https://www.science.org/doi/10.1126/sciimmunol.add4374', '2023/11/03', ''),
(4, '福岛核事故污染水的排放：宏观和微观模拟', '从宏观和微观两个分析模型分析了2023年起处理后的福岛核事故污染水排入太平洋的扩散过程。结果表明，氚将在1200天内扩散到整个北太平洋，这对制定全球应对策略具有重要意义。', 'https://pubmed.ncbi.nlm.nih.gov/35070334/', '2021/11/26', ''),
(5, '福岛核事故后第一年实施的食品和水安全规定', '2011年3月11日下午，一场历史性的地震和海啸在日本东北海岸造成巨大破坏，次日清晨，福岛核电站1号核电站受灾反应堆释放放射性核素。2011 年 3 月 15 日，在表层土壤和植物中检测到高水平的放射性碘和放射性铯，因此于 2011 年 3 月 16 日开始对食物和水进行采样以进行监测调查。2011年3月17日，为受放射性碘、放射性铯、铀、钚和其他超铀α排放物订定临时规管值，以规管受放射性污染的食物和水的安全。2011 年 3 月 21 日，首次下令限制受污染物品的分发和消费。截至目前，自来水、生鲜奶、蔬菜、蘑菇、水果、坚果、海藻、海洋无脊椎动物、沿海鱼类、淡水鱼、牛肉、野生动物肉、糙米、小麦、茶叶等食品的污染情况均已超过暂行规例值。在2011年3月16日至2011年5月21日期间抽取的样本和在2011年3月18日至今抽取的放射性铯样本均超出放射性碘的暂定规管值。所有限制均在每件物品首次超过临时法规值后的 318 天内实施。本文根据截至2012年3月31日的现有资料，总结了执行监测调查和限制的政策，以及220 411个样本的监测结果和实施的限制。', 'https://academic.oup.com/jrr/article/53/5/641/914129', '2012/07/22', ''),
(6, '福岛核事故对农业的影响', '事故发生后，东京大学研究生院农业与生命科学研究生院的40至50名学术人员立即成立了一个独立小组，以监测放射性物质在野外的行为及其对农田、森林、河流、动物等的影响。当核电站的放射性核素落下时，它们立即被吸附在它们第一次接触的地点;因此，在事故发生时，尘埃被发现为暴露在空气中的任何东西表面的散落斑点。随着时间的流逝，吸附变得更强，因此放射性核素现在很难去除。本报告总结了我们对农业田地的广泛影响的研究结果。', 'https://academic.oup.com/jrr/article/57/S1/i47/2580511', '2016/08/16', ''),
(7, '福岛核事故后天然放射性核素和人工放射性核素的剂量比较', '由于福岛第一核电站事故，浪江町的撤离人员仍然无法在该镇居住，有些人继续住在临时住房单元中。在这项研究中，测量了福岛县临时住房设施、公寓和独立式住宅的氡活度浓度，以估计居民的年度内部暴露剂量。使用被动氡-钍监测器（使用CR-39）和脉冲型电离室来评估氡活度浓度。临时住房单元（包括医疗诊所、公寓和独立式住宅）的平均氡活度浓度分别为5、7和9 Bqm−3。假设居民在这些设施中居住一年，评估每种住房类型中室内氡的平均年有效剂量分别为 0.18、0.22 和 0.29 mSv。根据室内氡测量结果和公布的数据，估计了福岛县所有居民因自然和人工来源而获得的平均有效剂量。从浪江镇撤离的人员因自然来源而获得的平均有效剂量估计为1.9毫希沃特。相比之下，在FDNPP事故发生后的第一年，由于事故的人工来源，疏散人员的平均有效剂量为5.0 mSv。虽然居民因天然放射性核素而遭受的内部和外部暴露是不可避免的，但通过改变居民的某些行为，可以降低因人工放射性核素而产生的外部暴露。', 'https://academic.oup.com/jrr/article/57/4/422/2580367', '2016/08/03', ''),
(8, '福岛核事故后为减轻辐射暴露和风险沟通挑战而开展的公共卫生活动', '我们总结了2011年3月11日福岛核事故发生后为减轻公众辐射暴露而采取的公共卫生行动，以记录为备灾所吸取的宝贵经验教训。从受辐射影响地区撤离和控制各种食品的分配，有助于减少福岛事故造成的外部和内部辐射暴露。然而，在应急响应工作和随后的核灾难处理阶段，风险沟通也是一个重要问题。为了协助他们的康复过程，应继续通过双向通信向受辐射影响的社区传播可靠、可靠的科学信息。我们将描述核灾难发生后早期、中期和后期的基本公共卫生行动，这些行动将有助于应对其他核或辐射灾难的放射性准备规划。 ', 'https://academic.oup.com/jrr/article/56/3/422/917195', '2015/04/09', ''),
(9, '核电站事故后福岛旅行者的细胞遗传学生物剂量测定：没有证据表明增加了双着丝点的产生量', '福岛核事故发生后前往污染地区的人对健康影响感到担忧。然而，如果没有个人剂量测量，任何不良健康影响的医疗随访将很困难。细胞遗传学生物剂量测定法是回顾性评估吸收剂量的合理方法。我们分析了265名福岛旅行者的双着丝粒染色体，他们大多是记者和救援人员，他们在核紧急情况下被派往日本东北部。作为对照组，招募了 37 名自事故发生后未访问过日本的健康志愿者。比较了旅行者和对照组的剂量反应校准曲线计算的二元剂量和吸收剂量。', 'https://academic.oup.com/jrr/article/53/6/876/974580', '2012/08/01', ''),
(10, '东京电力公司福岛第一核电站事故中7名核电工人没有甲状腺受损的证据：甲状腺状况的10年随访结果', '2011年3月，东京电力公司（TEPCO）福岛第一核电站（FDNPP）发生事故后，在应急行动中，7名应急核工作人员因摄入放射性核素（主要是I-131）而内部暴露，他们前往国立放射科学研究所（NIRS）门诊进行医学评估。他们在第一次访问后进行了 10 年的随访。估计的甲状腺承诺等效剂量分布在 3.2 至 1.2 × 10 Sv 之间。这群人被认为在事故中受到的曝光率最高。所有工人均未出现甲状腺功能异常的症状。检查，包括甲状腺功能检查和超声波检查，没有发现与辐射暴露有关的异常。然而，未来需要在更长的时间内持续监测他们的甲状腺状况。', 'https://academic.oup.com/jrr/article/64/2/294/6968638', '2023/01/04', '');

-- --------------------------------------------------------

--
-- 表的结构 `migration`
--

CREATE TABLE `migration` (
  `version` varchar(180) NOT NULL,
  `apply_time` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `migration`
--

INSERT INTO `migration` (`version`, `apply_time`) VALUES
('m000000_000000_base', 1587561487),
('m130524_201442_init', 1587561498),
('m180628_144021_create_table_visitor', 1590677975),
('m180628_144042_create_table_visitor_log', 1590678493),
('m180628_144113_create_table_visitor_agent', 1590678728),
('m180628_144130_create_table_country', 1590678729),
('m180630_142222_create_table_visitor_service_error', 1590678729),
('m190124_110200_add_verification_token_column_to_user_table', 1587561499),
('m200424_120117_create_article_table', 1588648352),
('m200424_120247_create_category_table', 1588648352),
('m200424_120310_create_tag_table', 1588648352),
('m200424_120410_create_comment_table', 1588648353),
('m200424_120432_create_article_tag_table', 1588648354),
('m200502_141910_create_video_table', 1588648354),
('m200504_035720_create_video_view_table', 1588648355),
('m200504_041125_create_video_like_table', 1588648356),
('m200504_065820_create_subscriber_table', 1588648357),
('m200504_092524_create_fulltext_index_on_video', 1588648357),
('m200509_083851_add_date_to_comment', 1589013653),
('m200514_152015_covid_map', 1589470243);

-- --------------------------------------------------------

--
-- 表的结构 `pcounter_save`
--

CREATE TABLE `pcounter_save` (
  `save_name` varchar(10) NOT NULL,
  `save_value` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `pcounter_save`
--

INSERT INTO `pcounter_save` (`save_name`, `save_value`) VALUES
('counter', 15),
('day_time', 2460330),
('max_count', 5),
('max_time', 1591437600),
('yesterday', 0);

-- --------------------------------------------------------

--
-- 表的结构 `pcounter_users`
--

CREATE TABLE `pcounter_users` (
  `user_ip` varchar(32) NOT NULL,
  `user_time` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `pcounter_users`
--

INSERT INTO `pcounter_users` (`user_ip`, `user_time`) VALUES
('::1', 1705772386);

-- --------------------------------------------------------

--
-- 表的结构 `subscriber`
--

CREATE TABLE `subscriber` (
  `id` int(11) NOT NULL,
  `channel_id` int(11) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `created_at` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

-- --------------------------------------------------------

--
-- 表的结构 `tag`
--

CREATE TABLE `tag` (
  `id` int(11) NOT NULL,
  `title` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `username` varchar(32) NOT NULL,
  `auth_key` varchar(32) NOT NULL,
  `password_hash` varchar(256) NOT NULL,
  `password_reset_token` varchar(256) DEFAULT NULL,
  `email` varchar(256) NOT NULL,
  `status` int(11) NOT NULL DEFAULT 10,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  `verification_token` varchar(256) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`id`, `username`, `auth_key`, `password_hash`, `password_reset_token`, `email`, `status`, `created_at`, `updated_at`, `verification_token`) VALUES
(1, 'milkyship', 'ACPVpKwXicHQNh9-btnw1VxsPFZU8uFw', '$2y$13$COl3Z9FRP.1GUQvrcKcByuJ.DrcuOlLqxtF3U305yLOJ0GYDYy5Fm', NULL, '1214208054@qq.com', 10, 1588646532, 1588646532, 'YVTlSTPO-mDNeW7jaSDTWLpk2WAMwNfl_1588646532'),
(2, '123', 'huC507kpuZUnIO99UeDzmadvi2o6-enk', '$2y$13$rBCFD0Nl3bXwZhtNjlac7.MfYzLNxbDjh3dGTTMXjdJxF7Xu8Y5ja', NULL, '13687978877jz@gmail.com', 10, 1588646558, 1588646558, 'W1DwwM517WqyZt0lZsmhGVS8vUdmR8Et_1588646558'),
(3, 'test002', 'lhSwbukLwzuNkg6_ss7yN0twpflpidY4', '$2y$13$RhMfgU17e9H5PZouEQldHO5UnT1B5ng/uCdXiIm8C/v1CWPXL1lZi', 'oGYjaNQ4avq35C2ydL-WV2CCacK4t6PT_1590071409', '962417405@qq.com', 10, 1588646585, 1590071409, 'szfJtKXBz_9MzJIAlrsp4BoUsAYalloU_1588646585'),
(4, '1234', 'TOAiE6uss3m6ZiFdWghEQPRokKMLEY4k', '$2y$13$/szuloUk02wCwlE.KM87se2Z/aigHeEWhJBeSfKCBe0I9.m5cyBzu', NULL, 'hello@hello.com', 10, 1588647114, 1588647150, 'oMQW1i_J6W6-eGC0Ge8g5vE6XA3v7g41_1588647114'),
(5, 'lyx55', 'Ue7X9mCJE4-ys_BgYHwbph-Li88VCeKM', '$2y$13$oOumrGprMZhVY2.3/HnkJOM/6RVstuyW4u7eJEXbErPHf1br2wg0i', NULL, 'lyanxin55@gmail.com', 10, 1590071281, 1590071281, 'r8TqhFvBU_9fbsXK8EzSZmkkikxq1rfQ_1590071281'),
(6, 'jarvis', '97_0kFrTcmddvKItaZ4uro9cKP_jAcHy', '$2y$13$QkoY.LTNV/nO5gy/w/qQ8.JpCfNSN65ajEuf3UvuD20VxEYs.32LW', NULL, '1013198002@qq.com', 10, 1590128798, 1590128798, 'J5PniCX-X8N1vCR8cG3uJcHu2S6Jx9nZ_1590128798'),
(7, 'test111', 'fiUeC8xQZClAEtxE1khZ54bcL4gWKQiL', '$2y$13$weL7UeWH.Zm0L2r0PtyT1uHKzDthZKSiSMxBTLbwkEGwS6//Q1pHe', NULL, 'test111@test.com', 10, 1590474261, 1590474261, 'QXoKZ8Crcsz4C8VKOfzXBNBYk0_Kth4B_1590474261'),
(8, 'debug', 'FrqD4ZQVQr0S7bSddLUL2wQUC2Oseyq_', '$2y$13$p3zr2muYjxfx8pv/LYjp1OK6KEs1cgnU9RW907byh4CAT0NEm/Bae', NULL, '54656dasd@qq.com', 10, 1590496256, 1590496256, '60JsdaTlT-Mopuv0glBdUpA0wH6v1XGo_1590496256'),
(9, 'gugu', 'OnIuwKL0SBZXSlHCEJ59kxzE4S-bJkWl', '$2y$13$UXnGD67JjVNvpo2558CIGu2uYzCFM0AZuR3JYJI53RoisJuapoko2', NULL, '2878271548@qq.com', 10, 1590560759, 1590560759, 'vKmFbMtJsnJ1eYFJ7pGXlBuTPpxfyj3k_1590560759'),
(10, 'test004', '5yJhvZ55NbCjERbd5ioYdXfnNhpdMF2p', '$2y$13$9KVjjuUPfifs81gGWFsF6eJpFRUChZYqReHcGioTCWjoyAvYBdl/C', NULL, 'test004@test.com', 10, 1591261917, 1591261917, 'G536EVUwPCA9fgL2ox_3RVHjQ1osKT0G_1591261917'),
(11, 'test0001', 'DPvL41RjBq90JMscOHILN92pTkOxAiBU', '$2y$13$d51mrJlDOM1iXsM7kfORPumWOjbyREu61HFH//W9ZCg6gAKm0ypoW', NULL, 'test0001@test.com', 10, 1591261959, 1591261959, 'YBUVWNI2504MzOsoYDwxlFyV1z30KyxF_1591261959'),
(12, 'test', '3Frnt0UfzoaNfXGG6brW4yhMlhANXU7O', '$2y$13$qntwEMGVCeLkJZlo.ayhK.s1Xg4kBHIXmN5i/s7PP3SA.b5RAw.lS', NULL, 'test@test.com', 10, 1591877342, 1591877342, 'eyXsVWd4HZLM98T5k1DnaxWyQKXS1JYh_1591877342'),
(13, 'aakl', 'j8v9PKNNTOygXE7ITKTSP_ArmwpxlmNc', '$2y$13$mNXnhXAIpiyYNzwXCZvROuYsuHyEe9Hamtvik1zjcOnmXcgYAA122', NULL, '123@12.com', 9, 1591877676, 1591877676, 'W3lOogi7bzLIUubO6X4ZTOZHidSCSmc3_1591877676'),
(15, 'abc', 'WIP7_RPvn7yeK_TT9ZeORGccxo0YKQiz', '$2y$13$0mUiQNEghNu.siUf7nK08elGJGWSXr29Vw9Nn4TeEVZNDtS0mWzOS', NULL, '13687978877@163.com', 9, 1591879817, 1591879817, 'ANMxCvoAPIT5i7B1Sa21VlTecWmVJLYd_1591879817'),
(16, 'abab123', '2tKTUcrV3d-ESEAC7XnwmnSaVD_bXlfI', '$2y$13$GHs5NNB5Q8TkuoKt5h3IzepgDZPLzVS5w3dABBI6R.viQAKACQd5S', NULL, 'abab123@abab.com', 9, 1591880244, 1591880244, 'r4m0NFbPfFOEtEcDzCChiabm5bB6DEAi_1591880244'),
(17, '561', 'tarW-cpvTS0jaV23cINQfOKvklmQxQIW', '$2y$13$elbQjzMHYPJiSokr62Q2vuf4ibNpUL5rC99wLVr03ZeN7cSn.bfgO', NULL, '22@12.com', 9, 1591880310, 1591880310, 'WajXlJsfeSxxrFdUZsPg18gqLyojSJtr_1591880310'),
(18, '5678', 'q5f3X9-pPf-kHPg7IGb98BtJzqFmUgYt', '$2y$13$3tCRR1klXSdTB0vY1zmLO.z3Eyd842WcWmTiH9RxQgb51eEpSBH1K', NULL, '5566@12.com', 9, 1591880798, 1591880798, 'ikRtQcl8hKVhXhQLCDjwbWmrXdM9TwMd_1591880798'),
(19, 'test007', 'lNNX4WkG1EECS7CzW3jdGpv6TnAVg_xC', '$2y$13$SVsD1L3UO/iywaXlskjZXOeB65BsSiy4HCKJZyB1O3286Yvf84RKa', NULL, 'test007@test.com', 10, 1591880968, 1591880968, 'UmzmYgz-DiXjCGRC9mqGEn_oR48x9kLd_1591880968'),
(20, '5000', 'rdf2qNF50KTpTW4PK7SGdsobI4JmRKoN', '$2y$13$i87O/4JSE33KgXUxn7Xu9OGXCgtJzyO/hZcs3UM8M8sPLq.QWZ19G', NULL, 'a@ad.com', 10, 1591881447, 1591881447, 'Krd6AIQFRNl3FFD1CP66pzgTYzmdMuyu_1591881447'),
(22, 'test009', 'AM6OWTFRSpnNsDj4PWGmnnaKaFWVrl2k', '$2y$13$apHY1Hecs.P31vV6lOfCnOH7BZa9OILeQVhHiFpieB1xsK138Ve4O', NULL, 'test009@test.com', 10, 1591881794, 1591881794, 'EMBEmhtPokALIASpY78KvsSfJy_MR9xI_1591881794'),
(26, 'test10086', 'pU_u7G3Rgxvcmxal69DuF_IB48Rp2WEB', '$2y$13$572qE6TSa1JdBcZDkGcvWegA1jjLPFQ8u11YZ3Cf5Y7mjk6J1rKhi', NULL, '666@nankai.edu.cn', 10, 1591882489, 1591882489, 'Tdo4wtNhcgzdV5W0PZuW8Z1CJVn6kqiw_1591882489'),
(27, 'test10000', 'gj-SvZiKceBGQxB7M0g0P8X65ZBbhc94', '$2y$13$A3G0V944FQOWHRFVCbPTnuJb/dD/ID0QMnlJRLA0Lwapt0mkl/ydm', NULL, 't1000@mail.nankai.edu.cn', 10, 1591885728, 1591885728, 'GXq4eWslOOaFdP6H4qqbuPo3GZywYASH_1591885728'),
(28, '11', 'OaQXByfzyUbcLrjYQYbceEX0KcCYwFLT', '$2y$13$enJQPUesfAlqy6.lmtI.0.5M1nJPwt8lYzRHkigkL7UOV6d4WIXXe', NULL, '1@qq.com', 10, 1705745321, 1705745321, 'kJOSD9dHvW8R-swLblvfIgcnNtQAnoaS_1705745321'),
(29, 'sakura', 'ng5EyjtViHGdzqDWHPDOAp7SLPrPurJ2', '$2y$13$.XYnxuXefqdTB0HppkvHde.HTnUiZ6sTRC4Ypqt/YYUgf1.jKwGDS', NULL, '123@qq.com', 10, 1705763421, 1705763421, 'JnBx2YMYnZEquAS7GGieDpJVQACp_76z_1705763421');

-- --------------------------------------------------------

--
-- 表的结构 `video`
--

CREATE TABLE `video` (
  `video_id` varchar(16) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `tags` varchar(512) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `has_thumbnail` tinyint(1) DEFAULT NULL,
  `video_name` varchar(255) DEFAULT NULL,
  `created_at` int(11) DEFAULT NULL,
  `updated_at` int(11) DEFAULT NULL,
  `created_by` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `video`
--

INSERT INTO `video` (`video_id`, `title`, `description`, `tags`, `status`, `has_thumbnail`, `video_name`, `created_at`, `updated_at`, `created_by`) VALUES
('iUwK7DIv', '核污染.mp4', '央视报道', '', 1, 0, 'b0d4466604004578ab0f8bcd95a638ed_h2642000000nero_aac16-1.mp4', 1705768666, 1705768683, 29),
('x8tZJZXP', '核污染3.mp4', '央视报道', '核污染', 1, 0, 'e7bb43c924da42ff9bbeb78fa277c11d_h2642000000nero_aac16.mp4', 1705772243, 1705772272, 29),
('xRXrAnLz', '核污染2.mp4', '央视新闻', '', 1, 0, 'ba32e0b9a31f464181fb512eb24781c5_h2642000000nero_aac16.mp4', 1705768603, 1705768644, 29);

-- --------------------------------------------------------

--
-- 表的结构 `video_like`
--

CREATE TABLE `video_like` (
  `id` int(11) NOT NULL,
  `video_id` varchar(16) NOT NULL,
  `user_id` int(11) NOT NULL,
  `type` int(11) DEFAULT NULL,
  `created_at` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

-- --------------------------------------------------------

--
-- 表的结构 `video_view`
--

CREATE TABLE `video_view` (
  `id` int(11) NOT NULL,
  `video_id` varchar(16) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `created_at` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci ROW_FORMAT=DYNAMIC;

--
-- 转储表的索引
--

--
-- 表的索引 `article`
--
ALTER TABLE `article`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `id` (`id`) USING BTREE,
  ADD KEY `fk-article-user_id` (`created_by`) USING BTREE;
ALTER TABLE `article` ADD FULLTEXT KEY `title` (`title`,`description`);

--
-- 表的索引 `article_tag`
--
ALTER TABLE `article_tag`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `tag_article_article_id` (`article_id`) USING BTREE,
  ADD KEY `idx_tag_id` (`tag_id`) USING BTREE;

--
-- 表的索引 `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx-post-user_id` (`user_id`) USING BTREE,
  ADD KEY `idx-article_id` (`article_id`) USING BTREE;

--
-- 表的索引 `contact_form`
--
ALTER TABLE `contact_form`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `country`
--
ALTER TABLE `country`
  ADD PRIMARY KEY (`code`) USING BTREE,
  ADD UNIQUE KEY `country_code_idx` (`code`) USING BTREE;

--
-- 表的索引 `covid_map`
--
ALTER TABLE `covid_map`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `cov_news`
--
ALTER TABLE `cov_news`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD UNIQUE KEY `id` (`id`) USING BTREE;

--
-- 表的索引 `cov_research`
--
ALTER TABLE `cov_research`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `migration`
--
ALTER TABLE `migration`
  ADD PRIMARY KEY (`version`) USING BTREE;

--
-- 表的索引 `pcounter_save`
--
ALTER TABLE `pcounter_save`
  ADD PRIMARY KEY (`save_name`) USING BTREE;

--
-- 表的索引 `pcounter_users`
--
ALTER TABLE `pcounter_users`
  ADD PRIMARY KEY (`user_ip`) USING BTREE;

--
-- 表的索引 `subscriber`
--
ALTER TABLE `subscriber`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx-subscriber-channel_id` (`channel_id`) USING BTREE,
  ADD KEY `idx-subscriber-user_id` (`user_id`) USING BTREE;

--
-- 表的索引 `tag`
--
ALTER TABLE `tag`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `video`
--
ALTER TABLE `video`
  ADD PRIMARY KEY (`video_id`) USING BTREE,
  ADD KEY `idx-video-created_by` (`created_by`) USING BTREE;
ALTER TABLE `video` ADD FULLTEXT KEY `title` (`title`,`description`,`tags`);

--
-- 表的索引 `video_like`
--
ALTER TABLE `video_like`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx-video_like-video_id` (`video_id`) USING BTREE,
  ADD KEY `idx-video_like-user_id` (`user_id`) USING BTREE;

--
-- 表的索引 `video_view`
--
ALTER TABLE `video_view`
  ADD PRIMARY KEY (`id`) USING BTREE,
  ADD KEY `idx-video_view-video_id` (`video_id`) USING BTREE,
  ADD KEY `idx-video_view-user_id` (`user_id`) USING BTREE;

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `article`
--
ALTER TABLE `article`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- 使用表AUTO_INCREMENT `article_tag`
--
ALTER TABLE `article_tag`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `category`
--
ALTER TABLE `category`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `comment`
--
ALTER TABLE `comment`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- 使用表AUTO_INCREMENT `contact_form`
--
ALTER TABLE `contact_form`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- 使用表AUTO_INCREMENT `covid_map`
--
ALTER TABLE `covid_map`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5157;

--
-- 使用表AUTO_INCREMENT `cov_news`
--
ALTER TABLE `cov_news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43733;

--
-- 使用表AUTO_INCREMENT `cov_research`
--
ALTER TABLE `cov_research`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- 使用表AUTO_INCREMENT `subscriber`
--
ALTER TABLE `subscriber`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `tag`
--
ALTER TABLE `tag`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- 使用表AUTO_INCREMENT `video_like`
--
ALTER TABLE `video_like`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用表AUTO_INCREMENT `video_view`
--
ALTER TABLE `video_view`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;

--
-- 限制导出的表
--

--
-- 限制表 `article`
--
ALTER TABLE `article`
  ADD CONSTRAINT `fk-article-user_id` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE;

--
-- 限制表 `article_tag`
--
ALTER TABLE `article_tag`
  ADD CONSTRAINT `fk-tag_id` FOREIGN KEY (`tag_id`) REFERENCES `tag` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `tag_article_article_id` FOREIGN KEY (`article_id`) REFERENCES `article` (`id`) ON DELETE CASCADE;

--
-- 限制表 `comment`
--
ALTER TABLE `comment`
  ADD CONSTRAINT `fk-post-user_id` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE;

--
-- 限制表 `subscriber`
--
ALTER TABLE `subscriber`
  ADD CONSTRAINT `fk-subscriber-channel_id` FOREIGN KEY (`channel_id`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk-subscriber-user_id` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE;

--
-- 限制表 `video`
--
ALTER TABLE `video`
  ADD CONSTRAINT `fk-video-created_by` FOREIGN KEY (`created_by`) REFERENCES `user` (`id`) ON DELETE CASCADE;

--
-- 限制表 `video_like`
--
ALTER TABLE `video_like`
  ADD CONSTRAINT `fk-video_like-user_id` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk-video_like-video_id` FOREIGN KEY (`video_id`) REFERENCES `video` (`video_id`) ON DELETE CASCADE;

--
-- 限制表 `video_view`
--
ALTER TABLE `video_view`
  ADD CONSTRAINT `fk-video_view-user_id` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk-video_view-video_id` FOREIGN KEY (`video_id`) REFERENCES `video` (`video_id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
